OpenFOAM-3.0.0/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name ignitionCells;
        type cellSet;
        action new;

        source sphereToCell;
        sourceInfo
        {
            centre          (0.125 0.375 0.05);
            radius          0.005;
        }
    }
);


// ************************************************************************* //
